### Book1 uses small dataset

In [392]:
import pandas as pd

In [393]:
people = {
    'first': ['evan', 'john', 'jason'], 
    'last': ['Das', 'Wachs', 'Li'], 
    'email': ['evandas@gmail.com', 'johnwachs@hotmail.com', 'jasonli@outlook.com'], 
    'gender': ['Male', 'Male', 'Female']
}
df_people = pd.DataFrame(people)
df_people

   first   last                  email  gender
0   evan    Das      evandas@gmail.com    Male
1   john  Wachs  johnwachs@hotmail.com    Male
2  jason     Li    jasonli@outlook.com  Female

In [394]:
df_people['email']

0        evandas@gmail.com
1    johnwachs@hotmail.com
2      jasonli@outlook.com
Name: email, dtype: object

In [395]:
# generate a series object
type(df_people['email'])

pandas.core.series.Series

In [396]:
df_people[['last', 'email']]
# pass a list inside the dataframe

    last                  email
0    Das      evandas@gmail.com
1  Wachs  johnwachs@hotmail.com
2     Li    jasonli@outlook.com

In [397]:
df_people.columns

Index(['first', 'last', 'email', 'gender'], dtype='object')

In [398]:
df_people.iloc[[0, 1], [1, 2]]
# iloc using integer index or list[int, int, ...] to locate specific row(s)
# or you can choose specific index column
# inclusive
# slice: row[0, 1] and return their col[1, 2]

    last                  email
0    Das      evandas@gmail.com
1  Wachs  johnwachs@hotmail.com

In [399]:
df_people.loc[[0, 1], 'email']

0        evandas@gmail.com
1    johnwachs@hotmail.com
Name: email, dtype: object

In [400]:
df_people.set_index('email', inplace = True)
# set a column as index
# original wont be inplace changed by default

In [401]:
df_people.loc['evandas@gmail.com', 'last']
# then you can use loc to access the `index`

'Das'

You can rename the dataframe simply by input another list

In [402]:
df_people.columns
df_people.columns = ['first_name', 'last_name', 'Gender']
df_people

                      first_name last_name  Gender
email
evandas@gmail.com           evan       Das    Male
johnwachs@hotmail.com       john     Wachs    Male
jasonli@outlook.com        jason        Li  Female

You can also use list comprehension to rename all the column names

In [403]:
df_people.columns = [x.upper() for x in df_people.columns]
df_people

                      FIRST_NAME LAST_NAME  GENDER
email
evandas@gmail.com           evan       Das    Male
johnwachs@hotmail.com       john     Wachs    Male
jasonli@outlook.com        jason        Li  Female

`str.replace` function

In [404]:
df_people.columns = df_people.columns.str.replace('_', ' ')
df_people

                      FIRST NAME LAST NAME  GENDER
email
evandas@gmail.com           evan       Das    Male
johnwachs@hotmail.com       john     Wachs    Male
jasonli@outlook.com        jason        Li  Female

use `df.rename(columns = {})` function to rename, `inplace = False` by default

In [405]:
df_people.rename(columns = {
    'FIRST NAME': 'first_name',
    'LAST NAME': 'last_name'
}, inplace = True)

Notice `iloc` only receive Integers, it asks for index, `loc` can take both row labels (index) and column labels

In [406]:
df_people.loc['evandas@gmail.com', ['first_name', 'last_name']] = ['EVAN', 'DAS']
df_people

                      first_name last_name  GENDER
email
evandas@gmail.com           EVAN       DAS    Male
johnwachs@hotmail.com       john     Wachs    Male
jasonli@outlook.com        jason        Li  Female

change one value

In [407]:
df_people.loc['johnwachs@hotmail.com', 'first_name'] = 'JOHN'
df_people

                      first_name last_name  GENDER
email
evandas@gmail.com           EVAN       DAS    Male
johnwachs@hotmail.com       JOHN     Wachs    Male
jasonli@outlook.com        jason        Li  Female

In [408]:
df_peoplp = df_people.reset_index(inplace = True)
# reset index back to 0
df_people

                   email first_name last_name  GENDER
0      evandas@gmail.com       EVAN       DAS    Male
1  johnwachs@hotmail.com       JOHN     Wachs    Male
2    jasonli@outlook.com      jason        Li  Female

In [409]:
# set all email address to upper case
# Approach 1
df_people['email'] = df_people['email'].str.lower()
df_people

                   email first_name last_name  GENDER
0      evandas@gmail.com       EVAN       DAS    Male
1  johnwachs@hotmail.com       JOHN     Wachs    Male
2    jasonli@outlook.com      jason        Li  Female

__`apply` passes every columns by default__

In [410]:
# Approach 2
# Using apply to pass a function
def update_email(email):
    return email.upper()
df_people['email'].apply(update_email)

0        EVANDAS@GMAIL.COM
1    JOHNWACHS@HOTMAIL.COM
2      JASONLI@OUTLOOK.COM
Name: email, dtype: object

In [411]:
# Approach 3, same with Approach 2
df_people['email'].apply(lambda x: x.upper())

0        EVANDAS@GMAIL.COM
1    JOHNWACHS@HOTMAIL.COM
2      JASONLI@OUTLOOK.COM
Name: email, dtype: object

In [412]:
df_people

                   email first_name last_name  GENDER
0      evandas@gmail.com       EVAN       DAS    Male
1  johnwachs@hotmail.com       JOHN     Wachs    Male
2    jasonli@outlook.com      jason        Li  Female

In [413]:
df_people.apply(len, axis = 'columns')

0    4
1    4
2    4
dtype: int64

`axis = 'rows'` by default

In [414]:
df_people.apply(len)

email         3
first_name    3
last_name     3
GENDER        3
dtype: int64

In [415]:
df_people

                   email first_name last_name  GENDER
0      evandas@gmail.com       EVAN       DAS    Male
1  johnwachs@hotmail.com       JOHN     Wachs    Male
2    jasonli@outlook.com      jason        Li  Female

`map()` similar to list comprehension, it applies sth to every value in the list

`lambda x: x.map(len)` == `lambda col: [len(x) for x in col]`

######## Notice `map(func)` can only applied to pandas series， therefore `map(lambda x: )` is often used

In [416]:
df_people.apply(lambda x: x.map(len)) 
df_people.apply(lambda col: [len(x) for x in col])

   email  first_name  last_name  GENDER
0     17           4          3       4
1     21           4          5       4
2     19           5          2       6

`replace`

In [417]:
df_people['first_name'] = df_people['first_name'].replace({'EVAN': 'evan'})
df_people

                   email first_name last_name  GENDER
0      evandas@gmail.com       evan       DAS    Male
1  johnwachs@hotmail.com       JOHN     Wachs    Male
2    jasonli@outlook.com      jason        Li  Female

Print with string format/ combining columns, can also use `apply()` function

In [418]:
df_people['first_name'] + ' ' + df_people['last_name']

0      evan DAS
1    JOHN Wachs
2      jason Li
dtype: object

In [419]:
df_people['full_name'] = df_people['first_name'] + ' ' + df_people['last_name']
df_people

                   email first_name last_name  GENDER   full_name
0      evandas@gmail.com       evan       DAS    Male    evan DAS
1  johnwachs@hotmail.com       JOHN     Wachs    Male  JOHN Wachs
2    jasonli@outlook.com      jason        Li  Female    jason Li

Drop/Delete columns

In [420]:
df_test = df_people.drop(columns = ['first_name', 'last_name'])
# does not delete on the original one unless you set inplace = True
df_test

                   email  GENDER   full_name
0      evandas@gmail.com    Male    evan DAS
1  johnwachs@hotmail.com    Male  JOHN Wachs
2    jasonli@outlook.com  Female    jason Li

Also, you can split the column into multiple columns by using `expand = True` function

In [421]:
df_test[['first_name', 'last_name']] = df_test['full_name'].str.split(' ', expand = True)
df_test

                   email  GENDER   full_name first_name last_name
0      evandas@gmail.com    Male    evan DAS       evan       DAS
1  johnwachs@hotmail.com    Male  JOHN Wachs       JOHN     Wachs
2    jasonli@outlook.com  Female    jason Li      jason        Li

concat a new row by 

1. creating the new dataframe
2. using `concat` function
3. `ignore_index = True` will rearrange the index

In [422]:
new_row = pd.DataFrame({
    'email': ['hachimi@icloud.com'],
    'GENDER': ['Binary'], 
    'full_name': ['Hachimi'], 
    'last_name': ['Nameruto']
})
df_test = pd.concat([df_test, new_row], ignore_index = True)
df_test

                   email  GENDER   full_name first_name last_name
0      evandas@gmail.com    Male    evan DAS       evan       DAS
1  johnwachs@hotmail.com    Male  JOHN Wachs       JOHN     Wachs
2    jasonli@outlook.com  Female    jason Li      jason        Li
3     hachimi@icloud.com  Binary     Hachimi        NaN  Nameruto

Drop/ Delete Row by index

In [423]:
df_test.drop(index = 0)

                   email  GENDER   full_name first_name last_name
1  johnwachs@hotmail.com    Male  JOHN Wachs       JOHN     Wachs
2    jasonli@outlook.com  Female    jason Li      jason        Li
3     hachimi@icloud.com  Binary     Hachimi        NaN  Nameruto

First set up a filter, then using `.index` to locate the row

In [424]:
filt = df_test['full_name'] == 'JOHN Wachs'
df_test.drop(index = df_test[filt].index)

                 email  GENDER full_name first_name last_name
0    evandas@gmail.com    Male  evan DAS       evan       DAS
2  jasonli@outlook.com  Female  jason Li      jason        Li
3   hachimi@icloud.com  Binary   Hachimi        NaN  Nameruto

Sort Data

In [425]:
df_people

                   email first_name last_name  GENDER   full_name
0      evandas@gmail.com       evan       DAS    Male    evan DAS
1  johnwachs@hotmail.com       JOHN     Wachs    Male  JOHN Wachs
2    jasonli@outlook.com      jason        Li  Female    jason Li

Sort using `sort_values(by = [], ascending = [True, False, ...])` function, `by = ` either a str in which represents column's name, or a `list[str1, str2, ...]` where denotes if col `str1` are the same, sort by col `str2`. `ascending` can be passed into a list, where it corresponds with the by `list`, it enables different sorting rules.

In [426]:
# when ascending is a single value
df_people.sort_values(by = ['first_name', 'last_name'], ascending = False)

                   email first_name last_name  GENDER   full_name
2    jasonli@outlook.com      jason        Li  Female    jason Li
0      evandas@gmail.com       evan       DAS    Male    evan DAS
1  johnwachs@hotmail.com       JOHN     Wachs    Male  JOHN Wachs

In [427]:
# add another row
new = pd.DataFrame({
    'email': ['d@email.com'], 
    'first_name': ['A'],
    'last_name': ['DAS'],
    'full_name': ['A DAS']
})
df_people = pd.concat([df_people, new], ignore_index = True)
df_people

                   email first_name last_name  GENDER   full_name
0      evandas@gmail.com       evan       DAS    Male    evan DAS
1  johnwachs@hotmail.com       JOHN     Wachs    Male  JOHN Wachs
2    jasonli@outlook.com      jason        Li  Female    jason Li
3            d@email.com          A       DAS     NaN       A DAS

Notice `last_name` is sorted in descending alphabetical order, when `last_name` are same, it is sorted by `first_name` in ascending alphabetical order

In [431]:
# sort first last first alphabetically in descending order, then sort last name in ascending order
df_people.sort_values(by = ['last_name', 'first_name'], ascending = [False, True]) # .reset_index(drop=True) reset index

                   email first_name last_name  GENDER   full_name
1  johnwachs@hotmail.com       JOHN     Wachs    Male  JOHN Wachs
2    jasonli@outlook.com      jason        Li  Female    jason Li
3            d@email.com          A       DAS     NaN       A DAS
0      evandas@gmail.com       evan       DAS    Male    evan DAS

Notice now the index is not sorted automatically, therefore, if you want the sorted dataframe to be sorted back, simply use `df.sort_index()`